from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد ذكي مهمتك توليد استجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الاستجابة بناءً على المستندات المقدمة.",
    "تجاهل المستندات التي لا علاقة لها بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد استجابة.",
    "يجب أن تكون الاستجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا ومختصرًا في استجابتك، وتجنب المعلومات غير الضرورية.",
]))

#### Document ####

document_prompt = Template("\n".join([
    "## المستند رقم: $doc_num",
    "### المحتوى: $chunk_text",
]))

#### Footer ####

footer_prompt = Template("\n".join([
    "بناءً على المستندات المذكورة أعلاه فقط، يرجى توليد إجابة للمستخدم.",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))